frontend/controllers/NewsController.php

SELECT * FROM `news` WHERE `id`='3'
---
	public function actionDetail($id = 0, $name, $page = 0, $cid = 0) {
		$product = News::findOne($id);