frontend/controllers/SiteController.php

	public function actionIndex(){
		$this->view->title = 'Bánh lọc Phương Thu. Món ngon Quảng Bình tại Hà Nội';
		// $products = Product::find()->andWhere(['status' => 0])->orderBy('position')->limit(15)->all();
		$boxs = BoxPromotion::find()->andWhere(['status' => 1])->with(['product'])->orderBy('position')->all();
---
SELECT * FROM `box_promotion` WHERE `status`=1 ORDER BY `position`
SELECT * FROM `product` WHERE `id` IN (2, 1, 5, 18, 16)