frontend/components/Controller.php

    public function init()
    {
        parent::init();

        $model = InfoConfig::findOne(1);
---
SELECT * FROM `info_config` WHERE `id`=1