frontend/views/layouts/main.php

SELECT `id`, `categories`, `name`, `keywords`, `image`, `status`, `rating`, `view`, `createTime`, `categoryId`, `staffId` FROM `news` WHERE `status`=0 ORDER BY `id` DESC LIMIT 5
---
use yii\helpers\Json;
use common\models\News;

$newss = News::find()
->select('id, categories, name, keywords, image, status, rating, view, createTime, categoryId, staffId')
->limit(5)
->andWhere(['status' => 0])
->orderBy('id desc')
->all();