frontend/views/site/index.php

}


$products1 = Product::find()
->andWhere(['status' => 0])
->orderBy('position')
->limit(15)
->andWhere(['categoryId' => 6])
->all();

$products2 = Product::find()
->andWhere(['status' => 0])
->orderBy('position')
->limit(15)
->andWhere(['categoryId' => 1])
->all();

$products3 = Product::find()
->andWhere(['status' => 0])
->orderBy('position')
->limit(15)
->andWhere(['categoryId' => 8])
->all();

$products4 = Product::find()
->andWhere(['status' => 0])
->orderBy('position')
->limit(15)
->andWhere(['categoryId' => 9])
->all();
---
SELECT * FROM `product` WHERE (`status`=0) AND (`categoryId`=6) ORDER BY `position` LIMIT 15
SELECT * FROM `product` WHERE (`status`=0) AND (`categoryId`=1) ORDER BY `position` LIMIT 15
SELECT * FROM `product` WHERE (`status`=0) AND (`categoryId`=8) ORDER BY `position` LIMIT 15
SELECT * FROM `product` WHERE (`status`=0) AND (`categoryId`=9) ORDER BY `position` LIMIT 15